Repository: AhmedAbdElateef/X--SocialMedia
Catalog: assets/localization/app_*.arb
Languages: ar

# appTitle
source: Social_X
ar: إكس

# onBoardingTitle
source: {index, select, 0{Meet new people} 1{Contact your friends} 2{Find nearby friends} other{}}
ar: {index, select, 0{تعرف على اصدقاء جدد} 1{تواصل مع اصدقائك} 2{اعثر على اصدقائك القريبين} other{}}

# onBoardingDescription
source: {index, select, 0{Expand your social circle and meet new people for diverse perspectives, growth, and meaningful connections.} 1{Stay connected and reach out to your friends for meaningful interactions and cherished moments.} 2{Discover and connect with friends in your vicinity for local meetups and shared experiences.} other{}}
ar: {index, select, 0{قم بتوسيع دائرتك الاجتماعية والتعرف على أشخاص جدد من أجل وجهات نظر متنوعة ونمو واتصالات هادفة.} 1{اكتشف وتواصل مع الأصدقاء في المنطقة المجاورة لك من أجل اللقاءات المحلية والتجارب المشتركة.} 2{ابق على اتصال وتواصل مع أصدقائك من أجل تفاعلات هادفة ولحظات عزيزة.} other{}}

source: Email
ar: البريد الالكترونى

source: User Name
ar: إسم المستخدم

source: Password
ar: كلمة المرور

source: Forgot Password
ar: نسيت كلمه المرور

source: Login
ar: تسجيل الدخول

source: Or Log In By
ar: أو

source: Don''t Have Account ?
ar: ليس لديك حساب ؟

source: Already Have Account ?
ar: هل تملك حساب ؟

source: SignUp
ar: إنشاء حساب

source: Verify
ar: تحقق

source: Type Your Email
ar: أدخل البريد الالكترونى

source: Send
ar: إرسال

source: Phone Number
ar: أدخل رقم الهاتف

source: Email verification
ar: التحقق عن طريق البريد الإلكتروني

# resetPasswordMessageAlert
source: We will send you instruction on how to reset your password
ar: سوف نرسل لك تعليمات حول كيفية إعادة تعيين كلمة المرور الخاصة بك

source: Cancel
ar: إلغاء

# emailError
source: {errorMessage, select, empty{Email is empty} invalid{Email is invalid} other{}}
ar: {errorMessage, select, empty{بريد إلكتروني فارغ} invalid{بريد إلكتروني غير صالح} other{}}

# passwordError
source: {errorMessage, select, empty{Password is empty} invalid{Password is weak} other{}}
ar: {errorMessage, select, empty{كلمة مرور فارغة} invalid{كلمة مرور غير صالحة} other{}}

# toastError
source: {error, select, network_error{No Internet Connection} user_not_found{Email Not Found} invalid_credential{Invalid Email Or Password} email_already_exists{Account Already Exists} wrong_verification_code{Wrong Code} invalid_input{Invalid Input} user_canceled_login{Login canceled} wrong_login_method{Wrong login method} unsupported_file{This file is not supported} file_upload_failed{File upload failed} other{}}
ar: {error, select, network_error{لا يوجد اتصال بالانترنت} user_not_found{هذا المستخدم غير موجود} invalid_credential{بريد الكترونى او كلمة مرور خاطئة} email_already_exists{هذا الحساب موجود بالفعل} wrong_verification_code{رمز غير صحيح} invalid_input{مدخلات غير صالحة} user_canceled_login{تم إلغاء تسجيل الدخول} wrong_login_method{هذا الايميل مسجل بطريقة تسجل اخرى} unsupported_file{هذا الملف غير مدعوم} file_upload_failed{تعذر رفع هذا الملف} other{}}

# usernameError
source: {errorMessage, select, empty{UserName is empty} invalid{UserName is invalid} other{}}
ar: {errorMessage, select, empty{الإسم فارغ} invalid{الإسم غير صالح} other{}}

# phonenumberError
source: {errorMessage, select, empty{Phone Number is empty} invalid{Phone Number is invalid} other{}}
ar: {errorMessage, select, empty{رقم هاتف فارغ} invalid{رقم هاتف غير صالح} other{}}

source: Verification code sent
ar: تم إرسال كود التحقق

# appShare
source: Share App
ar: مشاركة التطبيق

source: App Language
ar: لغة التطبيق

# appTheme
source: Theme Mode
ar: وضع التطبيق

source: Privacy Policy
ar: سياسة البرنامج

source: Logout
ar: تسجبل الخروج

source: Feeds
ar: أخر الاخبار

source: Trending
ar: الشائع

source: Following
ar: المتابعون

# postOptions
source: {postOption, select, save{Save Post} unsave{Un Save} edit{Edit Post} delete{Delete Post} other{}}
ar: {postOption, select, save{حفظ المنشور} unsave{إلغاء الحفظ} edit{تعديل المنشور} delete{حذف المنشور} other{}}

source: Messages
ar: المحادثات

# addComment
source: Add a comment
ar: اضف تعليقك

source: Add image or video
ar: أضف صورة او فيديو

source: What's in your mind ? ...
ar: بماذا تفكر ؟ ...

source: Post
ar: انشر

source: Notifications
ar: الإشعارات

source: Settings
ar: الإعدادات

source: Comment likes
ar: تفاعلات التعليقات

source: Likes
ar: الإعجابات

source: Followers
ar: المتابعون

source: FaceBook
ar: فيس بوك

source: Instagram
ar: إنستجرام

source: Personal Website
ar: الموقع الالكترونى الشخصى

source: Save Changes
ar: حفظ التعديلات

source: bio
ar: الحالة

# search
source: Search Friends
ar: إبحث عن الأصدقاء

source: Edit Profile
ar: تعديل الملف الشخصى

# theme
source: {index, select, 0{Dark Mode} 1{Light Mode} other{}}}
ar: {index, select, 0{الوضع المظلم} 1{الوضع المضىء} other{}}}

# loginSlogan
source: Your Friends Await You
ar: أصدقائك فى إنتظارك

# signupSlogan
source: Start Making Friends
ar: أبدا فى صنع الأصدقاء

source: Saved Posts
ar: المنشورات المحفوظة

source: Deleting Post ...
ar: جارى خذف المنشور ...

source: Edit post
ar: تعديل المنشور

# postSaved
source: Post published successfully
ar: تم النشر بنجاح

# emptyPost
source: Post is empty!
ar: المنشور فارغ!

source: Update
ar: تحديث

source: Uploading ...
ar: جاري الرفع ...

source: Adding comment ...
ar: جاري إضافة التعليق ...

# userLikes
source: Likes ...
ar: الإعجابات ...

# profileUpdated
source: Profile updated successfully
ar: تم تعديل الملف الشخصي بنجاح

source: Address
ar: العنوان

source: Sharing post ...
ar: جاري مشاركة المنشور ...

source: Follow
ar: متابعة

source: Un Follow
ar: إلغاء المتابعة
